import java.text.DecimalFormat;
import java.text.DecimalFormatSymbols;
import java.util.Locale;

public class Main {

    public static void main(String[] args) {
    /*
    * Cамостоятельная работа:
    1. Создайте метод sumRange, который принимает два числа (начало и конец диапазона) и возвращает сумму всех чисел между ними (включительно).
    2. Создайте два перегруженных метода add: Первый складывает два целых числа; Второй складывает две строки.
    3. Напишите метод findMax, который принимает массив целых чисел и возвращает его максимальный элемент.
    4. Напишите метод, вычисляющий факториал числа с помощью цикла for
    5. Создайте перегруженные методы calculateArea: Для круга (принимает радиус); Для прямоугольника (принимает длину и ширину).
    6. Реализуйте метод, который принимает три числа и возвращает их среднее арифметическое.
    7. Напишите метод, который принимает два числа, представляющие длины катетов, и возвращает длину гипотенузы (используйте теорему Пифагора).
    8. Реализовать тесты для задач выше :)
    * */
    }
}